nvitya/vihal/rv32i/GD32V/F1/gd32vf103_vihal.h
/* main flash and SRAM memory map */
#define FLASH_BASE            ((uint32_t)0x08000000U)        /*!< main FLASH base address          */
#define SRAM_BASE             ((uint32_t)0x20000000U)        /*!< SRAM0 base address               */
#define OB_BASE               ((uint32_t)0x1FFFF800U)        /*!< OB base address                  */
#define DBG_BASE              ((uint32_t)0xE0042000U)        /*!< DBG base address                 */
#define EXMC_BASE             ((uint32_t)0xA0000000U)        /*!< EXMC register base address       */

// Core internal peripherals
#define SYSTIMER_BASE         ((uint32_t)0xD1000000U)
#define ECLIC_BASE            ((uint32_t)0xD2000000U)

/* peripheral memory map */
#define APB1_BUS_BASE         ((uint32_t)0x40000000U)        /*!< apb1 base address                */
#define APB2_BUS_BASE         ((uint32_t)0x40010000U)        /*!< apb2 base address                */
#define AHB1_BUS_BASE         ((uint32_t)0x40018000U)        /*!< ahb1 base address                */
#define AHB3_BUS_BASE         ((uint32_t)0x60000000U)        /*!< ahb3 base address                */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            (APB1_BUS_BASE + 0x00000000U)  /*!< TIMER base address               */
#define RTC_BASE              (APB1_BUS_BASE + 0x00002800U)  /*!< RTC base address                 */
#define WWDGT_BASE            (APB1_BUS_BASE + 0x00002C00U)  /*!< WWDGT base address               */
#define FWDGT_BASE            (APB1_BUS_BASE + 0x00003000U)  /*!< FWDGT base address               */
#define SPI_BASE              (APB1_BUS_BASE + 0x00003800U)  /*!< SPI base address                 */
#define USART_BASE            (APB1_BUS_BASE + 0x00004400U)  /*!< USART base address               */
#define I2C_BASE              (APB1_BUS_BASE + 0x00005400U)  /*!< I2C base address                 */
#define CAN_BASE              (APB1_BUS_BASE + 0x00006400U)  /*!< CAN base address                 */
#define BKP_BASE              (APB1_BUS_BASE + 0x00006C00U)  /*!< BKP base address                 */
#define PMU_BASE              (APB1_BUS_BASE + 0x00007000U)  /*!< PMU base address                 */
#define DAC_BASE              (APB1_BUS_BASE + 0x00007400U)  /*!< DAC base address                 */

/* advanced peripheral bus 2 memory map */
#define AFIO_BASE             (APB2_BUS_BASE + 0x00000000U)  /*!< AFIO base address                */
#define EXTI_BASE             (APB2_BUS_BASE + 0x00000400U)  /*!< EXTI base address                */
#define GPIO_BASE             (APB2_BUS_BASE + 0x00000800U)  /*!< GPIO base address                */
#define ADC_BASE              (APB2_BUS_BASE + 0x00002400U)  /*!< ADC base address                 */

/* advanced high performance bus 1 memory map */
#define DMA_BASE              (AHB1_BUS_BASE + 0x00008000U)  /*!< DMA base address                 */
#define RCU_BASE              (AHB1_BUS_BASE + 0x00009000U)  /*!< RCU base address                 */
#define FMC_BASE              (AHB1_BUS_BASE + 0x0000A000U)  /*!< FMC base address                 */
#define CRC_BASE              (AHB1_BUS_BASE + 0x0000B000U)  /*!< CRC base address                 */
#define USBFS_BASE            (AHB1_BUS_BASE + 0x0FFE8000U)  /*!< USBFS base address               */

//---------------------------------------------------------------------------------------
// ECLIC
//---------------------------------------------------------------------------------------

#define ECLIC_INT_CTL_BITCOUNT  4
#define ECLIC_INT_CTL_MASK   0xF0
#define ECLIC_INT_CTL_SHIFT     4

#define ECLIC_INT_ATTR_SHV              0x01
#define ECLIC_INT_ATTR_TRIG_LEVEL       0x00
#define ECLIC_INT_ATTR_TRIG_EDGE        0x02
#define ECLIC_INT_ATTR_TRIG_RISING      0x00
#define ECLIC_INT_ATTR_TRIG_FALLING     0x04
#define ECLIC_INT_ATTR_TRIG_MASK        0x06

#define ECLIC_NLBITS_LEVEL0_PRIO4    0
#define ECLIC_NLBITS_LEVEL1_PRIO3    1
#define ECLIC_NLBITS_LEVEL2_PRIO2    2
#define ECLIC_NLBITS_LEVEL3_PRIO1    3
#define ECLIC_NLBITS_LEVEL4_PRIO0    4

#define ECLIC_CFG_NLBITS_LSB              1
#define ECLIC_CFG_NLBITS_MASK    0x0000001E

typedef struct
{
  volatile uint8_t    IP;
  volatile uint8_t    IE;
  volatile uint8_t    ATTR;
  volatile uint8_t    CTL;
//
} eclic_irq_regs_t;

typedef struct
{
  volatile uint8_t    CFG;        // 00
  uint8_t             _pad1[3];   // 01
  volatile uint32_t   INFO;       // 04
  uint8_t             _pad8[3];   // 08
  volatile uint8_t    MTH;        // 0B
  uint8_t             pad10[0x1000 - 12];  // 0C

  eclic_irq_regs_t    INT[128];   // 0x1000
//
} eclic_regs_t;

#define ECLIC  ((eclic_regs_t *)(ECLIC_BASE))

inline void eclic_set_nlbits(uint8_t nlbits)
{
  uint8_t cfgr = ECLIC->CFG;
  cfgr &= ~ECLIC_CFG_NLBITS_MASK;
  cfgr |= (nlbits << ECLIC_CFG_NLBITS_LSB);
  ECLIC->CFG = cfgr;
}

inline void eclic_int_set_level_prio(uint32_t intnum, uint8_t level_prio)
{
  uint8_t ctlr = ECLIC->INT[intnum].CTL;
  ctlr &= ~ECLIC_INT_CTL_MASK;
  ctlr |= (level_prio << ECLIC_INT_CTL_SHIFT);
  ECLIC->INT[intnum].CTL = ctlr;
}

inline void eclic_int_set_attr(uint32_t intnum, uint8_t attr)
{
  ECLIC->INT[intnum].ATTR = attr;
}

inline void eclic_int_set_mode_level(uint32_t intnum)
{
  uint8_t tmp = ECLIC->INT[intnum].ATTR;
  tmp &= ~ECLIC_INT_ATTR_TRIG_MASK;
  ECLIC->INT[intnum].ATTR = tmp;
}

inline void eclic_int_set_mode_rising_edge(uint32_t intnum)
{
  uint8_t tmp = ECLIC->INT[intnum].ATTR;
  tmp &= ~ECLIC_INT_ATTR_TRIG_MASK;
  tmp |= (ECLIC_INT_ATTR_TRIG_EDGE | ECLIC_INT_ATTR_TRIG_RISING);
  ECLIC->INT[intnum].ATTR = tmp;
}

inline void eclic_int_set_mode_falling_edge(uint32_t intnum)
{
  uint8_t tmp = ECLIC->INT[intnum].ATTR;
  tmp &= ~ECLIC_INT_ATTR_TRIG_MASK;
  tmp |= (ECLIC_INT_ATTR_TRIG_EDGE | ECLIC_INT_ATTR_TRIG_FALLING);
  ECLIC->INT[intnum].ATTR = tmp;
}

inline void eclic_int_set_shv(uint32_t intnum, uint8_t shv)
{
  uint8_t tmp = ECLIC->INT[intnum].ATTR;
  tmp &= ~ECLIC_INT_ATTR_SHV;
  tmp |= shv;
  ECLIC->INT[intnum].ATTR = tmp;
}

